In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('train.csv', index_col = 'PassengerId')

In [4]:
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
#Какое количество мужчин и женщин ехало на корабле? В качестве
#ответа приведите два числа через пробел.
sex = data.groupby('Sex').agg({'Sex':'count'})
sex = sex['Sex'].tolist()
print(*sex)

314 577

In [6]:
#Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах
survived = data.Survived.sum()
aLL = data.Sex.count()
print(round(survived*100/aLL, 2))

38.38

In [7]:
#Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах
pclass = data.groupby('Pclass').agg({'Pclass':'count'})
cAll = pclass.Pclass.tolist()
c1 = cAll[0]
print(round(c1*100/aLL, 2))

24.24

In [107]:
#1)# Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. Посчитайте среднее и медиану возраста
#пассажиров. В качестве ответа приведите два числа через пробел.
medi = data.Age.median()
sra = data.Age.fillna(medi).mean()
print(sra, medi)

29.36158249158249 28.0

In [118]:
#2)#
data = data.dropna()
medi = data.Age.median()
sra = data.Age.mean()
print(sra, medi)

35.6744262295082 36.0

In [119]:
#Коррелируют ли число братьев/сестер с числом родителей/детей?
#Посчитайте корреляцию Пирсона между признаками SibSp и Parch.
data[['SibSp','Parch']].corr()

          SibSp     Parch
SibSp  1.000000  0.255346
Parch  0.255346  1.000000

In [121]:
data[['SibSp','Parch']].corr()

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

In [206]:
#Какое самое популярное женское имя на корабле? Извлеките из
#полного имени пассажира (колонка Name) его личное имя (First
#Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных
#Vestrom, Miss. Hulda Amanda Adolfina
def col(S):
    if S.find('Mr.') >= 0:
        return
    elif S.find('Miss. ') >= 0:
        ss = S.find('Miss. ')
        S = S[ss+6:]
        cc = S.find(' ')
        
        return S[:cc]
        
    else:
        rs = S.find('(')


        S = S[rs+1:]
        sr = S.find(' ')
        d = S[:sr]
        if d[-1] == ',':
            return d[:-1]
        else:
        
            return d

In [207]:
data.Name = data.Name.apply(col)

In [208]:
data.Name = data.Name.dropna()

In [209]:
data.Name.value_counts()

Anna         12
Margaret     10
Elizabeth     9
Mary          8
Mar           6
             ..
Lucille       1
Elle          1
Telma         1
Susan         1
Eugeni        1
Name: Name, Length: 247, dtype: int64